int main()
{
    const int a1 = 5; //Променлива, на която не можем да сменим стойността!

    int a2 = 2;
    const int &b = a2; //Не можем да сменяме стойността на това, към което b рeферира

    const int a3 = 6;
    int &b2 = a3; // Това няма да тръгне, защото пробвате да направите неконстантна референция към константа. Така не може!!!

    int a4 = 9;
    const int *b3 = &a4; //Указател към константни данни. Не можем да променяме данните през него, но можем да го местим.

    int a5 = 8;
    int const *b4 = &a5; //Константен указател към инт. Можем да променяме данните, но не можем да местим указателя.

    int a6 = 7;
    const int const *b5 = &a6; //Константен указател към константни данни. Нито можем да местим, нито да променяме данните

}